// задана перша множина
const fr = [1, 2, 3, 4, 5];
// задана друга множина
const sc = [1, 9, 4, 25, 16];
// задане відображення
const u = [1, 2, 2, 9, 3, 4, 4, 25, 5, 16];

for(let coeff1 = 0; coeff1 < fr.length; coeff1++) {
    for(let coeff2 = 0; coeff2 < sc.length; coeff2++) {
        if (fr[coeff1] ** 2 === sc[coeff2]) {
            // тут задається умова для відображення, в даному випадку це квадрат
            console.log('Елемент 1ї множини: ', fr[coeff1], 'є відображенням елемента 2ї множини: ', sc[coeff2]);
        }
    }
}