// задана перша множина
const fr = [1, 2, 3, 4, 5];
// задана друга множина
const sc = [1, 9, 4, 25, 16, 3];

// бієкція (тільки один відповідник):
let bi = 0;
if (sc.length !== fr.length) {
    console.log('Бієкція не може бути виконана, бо кількість елементів в двух множинах не є рівна, а це суперечіть бієкції. ')
} else {
    console.log('Функція для даного бієктивного відображення: y = x²');
    for(let coeff1 = 0; coeff1 < fr.length; coeff1++) {
        for(let coeff2 = 0; coeff2 < sc.length; coeff2++) {
            if (fr[coeff1] ** 2 === sc[coeff2]) {
                // тут задається умова для відображення, в даному випадку це квадрат
                console.log('Елемент 1ї множини: ', fr[coeff1], 'має відображення в 2й множини: ', sc[coeff2]);
                bi++;
            }
        }
    }
    
    if (bi === fr.length) {
        console.log('Властивість бієкції виконана. Кожен елемент з першої множини має тільке одне відображення в другій.');
    } else {
        console.log('Властивість бієкції не виконана.');
    }
}
