// задана перша множина
const fr = [1, 2, 3, 4, 5];
// задана друга множина
const sc = [1, 9, 4, 25, 16, 3];

// ін’єкція (для неї повинно бути на один ел. в другій множині більше. Бажано,але не обов'язково):
console.log('Ін\'єктивне відображення: ');
    for(let coeff1 = 0; coeff1 < fr.length; coeff1++) {
        for(let coeff2 = 0; coeff2 < sc.length; coeff2++) {
            if (fr[coeff1] ** 2 === sc[coeff2]) {
                // тут задається умова для відображення, в даному випадку це квадрат
                console.log('Елемент 1ї множини: ', fr[coeff1], 'має відображення в 2й множини: ', sc[coeff2]);
            }
        }
    }
if (j > 0) {
    console.log('Елемент', sc[0], 'не зв\'язаний з іншим елементом з першої множини')
}


console.log('Функція для даного відображення: y = x²');
for(let coeff1 = 0; coeff1 < fr.length; coeff1++) {
    for(let coeff2 = 0; coeff2 < sc.length; coeff2++) {
        if (fr[coeff1] ** 2 === sc[coeff2]) {
            // тут задається умова для відображення, в даному випадку це квадрат
            console.log('Елемент 1ї множини: ', fr[coeff1], 'є відображенням елемента 2ї множини: ', sc[coeff2]);
        }
    }
}